
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/goda6565/lambda-bot/actions/runs/15225241289)



<pre><code>Apply complete! Resources: 0 added, 1 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.lambda.data.aws_iam_policy_document.lambda_policy_document: Reading...
module.api_gateway.aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/lambda/lambda-bot-prod-api-gateway]
module.lambda.aws_cloudwatch_log_group.lambda: Refreshing state... [id=/aws/lambda/lambda-bot-prod]
module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret["slack-bot-token"]: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3]
module.ecr.aws_ecr_repository.ecr_repository: Refreshing state... [id=lambda-bot-prod]
module.secrets_manager.aws_secretsmanager_secret.secretsmanager_secret["slack-signing-secret"]: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3]
module.api_gateway.aws_apigatewayv2_api.lambda_api: Refreshing state... [id=0pdgg6nqu1]
module.lambda.data.aws_iam_policy_document.lambda_policy_document: Read complete after 0s [id=2690255455]
module.lambda.aws_iam_role.lambda_role: Refreshing state... [id=lambda-bot-prod-role]
module.lambda.aws_iam_role_policy_attachment.lambda_role_policy_attachment: Refreshing state... [id=lambda-bot-prod-role-20250524055713202500000001]
module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version["slack-signing-secret"]: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3|terraform-20250524082129799000000003]
module.secrets_manager.aws_secretsmanager_secret_version.secretmanager_secret_version["slack-bot-token"]: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3|terraform-20250524082129800400000004]
module.lambda.data.aws_iam_policy_document.lambda_secret_manager_policy_document: Reading...
module.lambda.data.aws_iam_policy_document.lambda_secret_manager_policy_document: Read complete after 0s [id=949681195]
module.lambda.aws_iam_role_policy.lambda_secret_manager_policy: Refreshing state... [id=lambda-bot-prod-role:lambda-bot-prod-secret-manager-policy]
module.api_gateway.aws_apigatewayv2_stage.lambda_function_invoke_stage: Refreshing state... [id=$default]
module.lambda.aws_lambda_function.lambda: Refreshing state... [id=lambda-bot-prod]
module.lambda.aws_lambda_alias.lambda: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-prod:prod]
module.api_gateway.aws_lambda_permission.allow_apigateway: Refreshing state... [id=AllowInvokeFromApiGateway]
module.api_gateway.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=vfdjtep]
module.api_gateway.aws_apigatewayv2_route.lambda_function_route: Refreshing state... [id=n414fla]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "lambda-bot-prod"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-prod:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-prod:6/invocations" -> (known after apply)
        tags                           = {
            "Name" = "lambda-bot-prod"
        }
      ~ version                        = "6" -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "SLACK_BOT_TOKEN"      = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3"
              + "SLACK_SIGNING_SECRET" = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3"
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
module.lambda.aws_lambda_function.lambda: Modifying... [id=lambda-bot-prod]
module.lambda.aws_lambda_function.lambda: Modifications complete after 7s [id=lambda-bot-prod]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

Outputs:

api_gateway_invoke_url = "https://0pdgg6nqu1.execute-api.ap-northeast-1.amazonaws.com/"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":10,"Program":"tfcmt","SHA1":"785360a1da3c3c2c3a642982812ff5366c3cae43","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->